## Production: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 8 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_secretsmanager_secret_version.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "current"  {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret.environment_variables will be created
  + resource "aws_secretsmanager_secret" "environment_variables" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "environment_variables"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags                           = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all                       = {
          + "CostCenter" = "notification-canada-ca-production"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_sns_topic_subscription.alert_critical_us_west_2_to_opsgenie[0] will be updated in-place
  ~ resource "aws_sns_topic_subscription" "alert_critical_us_west_2_to_opsgenie" {
      + delivery_policy                 = ""
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ endpoint                        = (sensitive)
      + filter_policy                   = ""
        id                              = "arn:aws:sns:us-west-2:296255494825:alert-critical-us-west-2:9cfefb81-8126-4064-950c-c96a6f583d26"
      + redrive_policy                  = ""
      + subscription_role_arn           = ""
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_critical_us_west_2_to_opsgenie_ok[0] will be updated in-place
  ~ resource "aws_sns_topic_subscription" "alert_critical_us_west_2_to_opsgenie_ok" {
      + delivery_policy                 = ""
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ endpoint                        = (sensitive)
      + filter_policy                   = ""
        id                              = "arn:aws:sns:us-west-2:296255494825:alert-ok-us-west-2:de5a3f48-f8c8-4d77-8145-eac0e2b32a5a"
      + redrive_policy                  = ""
      + subscription_role_arn           = ""
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_to_sns_to_opsgenie[0] will be updated in-place
  ~ resource "aws_sns_topic_subscription" "alert_to_sns_to_opsgenie" {
      + delivery_policy                 = ""
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ endpoint                        = (sensitive)
      + filter_policy                   = ""
        id                              = "arn:aws:sns:ca-central-1:296255494825:alert-critical:7ea6e620-73b8-4695-ab80-845f01a95409"
      + redrive_policy                  = ""
      + subscription_role_arn           = ""
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_to_sns_to_opsgenie_ok[0] will be updated in-place
  ~ resource "aws_sns_topic_subscription" "alert_to_sns_to_opsgenie_ok" {
      + delivery_policy                 = ""
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ endpoint                        = (sensitive)
      + filter_policy                   = ""
        id                              = "arn:aws:sns:ca-central-1:296255494825:alert-ok:7bd77b94-83c9-4268-81f9-eb4327ef96b5"
      + redrive_policy                  = ""
      + subscription_role_arn           = ""
        # (9 unchanged attributes hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      + code_signing_config_arn        = ""
      + description                    = ""
        id                             = "notify-slack-critical"
      + image_uri                      = ""
      + kms_key_arn                    = ""
      + signing_job_arn                = ""
      + signing_profile_version_arn    = ""
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "SLACK_WEBHOOK_URL" = (sensitive)
                # (4 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.notify_slack_general.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      + code_signing_config_arn        = ""
      + description                    = ""
        id                             = "notify-slack-general"
      + image_uri                      = ""
      + kms_key_arn                    = ""
      + signing_job_arn                = ""
      + signing_profile_version_arn    = ""
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "SLACK_WEBHOOK_URL" = (sensitive)
                # (4 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      + code_signing_config_arn        = ""
      + description                    = ""
        id                             = "notify-slack-ok"
      + image_uri                      = ""
      + kms_key_arn                    = ""
      + signing_job_arn                = ""
      + signing_profile_version_arn    = ""
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "SLACK_WEBHOOK_URL" = (sensitive)
                # (4 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      + code_signing_config_arn        = ""
      + description                    = ""
        id                             = "notify-slack-warning"
      + image_uri                      = ""
      + kms_key_arn                    = ""
      + signing_job_arn                = ""
      + signing_profile_version_arn    = ""
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "SLACK_WEBHOOK_URL" = (sensitive)
                # (4 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 8 to change, 0 to destroy.

Changes to Outputs:
  + environment_variables_current_secret_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-sns-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
